Repository: VictorShekhov/hddtemp
Catalog: hddtemp-*.po
Languages: pl

source: WARNING: Drive %s doesn't seem to have a temperature sensor. WARNING: This doesn't mean it hasn't got one. WARNING: If you are sure it has one, please contact me (hddtemp@guzu.net). WARNING: See --help, --debug and --drivebase options.
pl: UWAGA: Dysk %s wydaje siê nie mieæ czujnika temperatury. UWAGA: Nie znaczy to, ze go na pewno nie ma. UWAGA: Je¶li masz pewno¶æ, ¿e ma, proszê skontaktowaæ siê z autorem UWAGA: (hddtemp@duzu.net). UWAGA: Opcje --help, --debug i --drivebase podadz± wiêcej informacji.

source: %s: %s: no sensor
pl: %s: %s: brak czujnika

source: WARNING: Drive %s doesn't appear in the database of supported drives WARNING: But using a common value, it reports something. WARNING: Note that the temperature shown could be wrong. WARNING: See --help, --debug and --drivebase options. WARNING: And don't forget you can add your drive to hddtemp.db
pl: UWAGA: Dysk %s nie wystêpuje w bazie danych obs³ugiwanych dysków UWAGA: Ale przy u¿yciu popularnej warto¶ci co¶ zwraca. UWAGA: Nale¿y mieæ na uwadze, ¿e pokazana temperatura mo¿e byæ z³a. UWAGA: Opcje --help, --debug i --drivebase podadz± wiêcej informacji. UWAGA: I nie nale¿y zapominaæ, ¿e mo¿na dodaæ swój dysk do hddtemp.db

source: %s: %s: %d%sC or %sF
pl: %s: %s: %d%sC lub %sF

source: %s: %s: drive is sleeping
pl: %s: %s: dysk jest w stanie u¶pienia

source: %s: %s: drive supported, but it doesn't have a temperature sensor.
pl: %s: %s: dysk obs³ugiwany, ale nie ma czujnika temperatury.

source: ERROR: %s: %s: unknown returned status
pl: B£¡D: %s: %s: nieznany zwrócony stan

source: If one of the field value seems to match the temperature, be sure to read the hddtemp man page before sending a report (section REPORT). Thanks.
pl: Je¶li jedno z pól wydaje siê zgadzaæ z temperatur±, nale¿y przeczytaæ stronê manuala hddtemp przed wys³aniem raportu (sekcja REPORT).

source: ERROR: invalid separator.
pl: B£¡D: nieprawid³owy separator.

source: ERROR: invalid port number.
pl: B£¡D: nieprawid³owy numer portu.

source: Usage: hddtemp [OPTIONS] [TYPE:]DISK1 [[TYPE:]DISK2]... hddtemp displays the temperature of drives supplied in argument. Drives must support S.M.A.R.T. TYPE could be SATA, PATA or SCSI. If omitted hddtemp will try to guess. -b --drivebase : display database file content that allow hddtemp to recognize supported drives. -D --debug : display various S.M.A.R.T. fields and their values. Useful to find a value that seems to match the temperature and/or to send me a report. (done for every drive supplied). -d --daemon : run hddtemp in TCP/IP daemon mode (port %d by default.) -f --file=FILE : specify database file to use. -l --listen=addr : listen on a specific interface (in TCP/IP daemon mode). -n --numeric : print only the temperature. -p --port=# : port to listen to (in TCP/IP daemon mode). -s --separator=C : separator to use between fields (in TCP/IP daemon mode). -S --syslog=s : log temperature to syslog every s seconds. -u --unit=[C|F] : force output temperature either in Celius or Fahrenheit. -q --quiet : do not check if the drive is supported. -v --version : display hddtemp version number. -w --wake-up : wake-up the drive if need. -4 : listen on IPv4 sockets only. -6 : listen on IPv6 sockets only. Report bugs or new drives to <hddtemp@guzu.net>.
pl: Sk³adnia: hddtem [OPCJE] [TYP:]DYSK1 [[TYP:]DYSK2]... hddtemp wy¶wietla temperaturê dysków podanych jako argumenty. Dyski musz± obs³ugiwaæ S.M.A.R.T. TYP mo¿e byæ SATA, PATA lub SCSI. W przypadku pominiêcia hddtemp próbuje odgadn±æ typ. -b --drivebase : wy¶wietlenie zawarto¶ci pliku bazy danych pozwalaj±cej programowi hddtemp rozpoznawaæ obs³ugiwane dyski. -D --debug : wy¶wietlenie ró¿nych pól S.M.A.R.T. oraz ich warto¶ci. Przydatne do znalezienia warto¶ci wygl±daj±cej na temperaturê i/lub wys³ania autorowi raportu (wykonywane dla ka¿dego podanego dysku). -d --daemon : uruchomienie hddtemp w trybie demona TCP/IP (domy¶lnie na porcie %d). -f --file=PLIK : podanie pliku bazy danych. -l --listen=ADR : nas³uchiwanie na podanym interefejsie (w trybie demona). -n --numeric : wypisanie tylko temperatury. -p --port=PORT : port do nas³uchiwania (w trybie demona TCP/IP). -s --separator=Z : separator umieszczany miêdzy polami (w trybie demona). -S --syslog=S : logowanie temperatury do sysloga co ka¿de S sekund. -u --unit=[C|F] : wymuszenie wyniku w stopniach Celsjusza lub Fahrenheita. -q --quiet : nie sprawdzanie, czy dysk jest obs³ugiwany. -v --version : wy¶wietlenie informacji o wersji hddtemp. -w --wake-up : obudzenie dysku w razie potrzeby. -4 : nas³uchiwanie tylko na gniazdach IPv4. -6 : nas³uchiwanie tylko na gniazdach IPv6. B³êdy lub nowe dyski proszê zg³aszaæ na adres <hddtemp@guzu.net>.

source: hddtemp version %s
pl: hddtemp wersja %s

source: ERROR: invalid interval.
pl: B£¡D: nieprawid³owy przedzia³.

source: Too few arguments: you must specify one drive, at least.
pl: Zbyt ma³o argumentów: trzeba podaæ co najmniej jeden dysk.

source: ERROR: can't use --debug and --daemon or --syslog options together.
pl: B£¡D: nie mo¿na u¿yæ naraz opcji --debug i --daemon lub --syslog.

source: ERROR: %s: can't determine bus type (or this bus type is unknown)
pl: B£¡D: %s: nie mo¿na okre¶liæ typu szyny (lub ten typ szyny jest nieznany)

source: unknown
pl: nieznany

source: S.M.A.R.T. not available
pl: S.M.A.R.T. niedostêpny

source: Regexp%s| Value | Description ------%s---------------------
pl: Regexp%s| Warto¶æ | Opis ------%s----------------

source: %s%s| %5d | %s
pl: %s%s| %7d | %s

source: hddtemp: can't open %1$s: %2$s
pl: hddtemp: nie mo¿na otwozryæ %1$s: %2$s

source: ERROR: syntax error at line %1$d in %2$s
pl: B£¡D: b³±d sk³adni w linii %1$d pliku %2$s

source: ERROR: line exceed %1$d characters in %2$s.
pl: B£¡D: linia przekracza %1$d znaków w %2$s.

source: log sense failed : %s
pl: Polecenie log sense nie powiod³o siê : %s
